app/controllers/api/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."author_id" = $1  [["author_id", 32]]
---
  def index
    #Note: only get the current user's notes
    # byebug
    #note_params is saying params[:note_order] is not permitted, even tho it is in permit method
    @notes = Note.where(author_id: current_user.id).order(params[:note_order])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", 9]]
---
  def show
    @note = Note.find(params[:id])