app/controllers/notes_controller.rb

  def index
    # byebug
    #Note: only get the current user's notes
    @notes = Note.where(author_id: current_user.id)
---
SELECT "notes".* FROM "notes" WHERE "notes"."author_id" = $1  [["author_id", 31]]